load_tests/basic.yml
config:
  target: "https://heroku-app-scaling.herokuapp.com"
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - duration: 600
      arrivalRate: 50
      name: "Sustained max load"
  defaults:
    headers:
      x-load-test-client: "mlaccetti"
scenarios:
  - flow:
      - get:
          url: "/api/profiles/jack"