load_tests/basic.yml
config:
  target: 'https://heroku-app-scaling.herokuapp.com/api'
  processor: './test-functions.js'
  phases:
    - duration: 120
      arrivalRate: 1
      rampTo: 50
      name: 'Warm up the application'
    - duration: 1200
      arrivalRate: 50
      name: 'Sustained max load'
  defaults:
    headers:
      x-load-test-client: 'mlaccetti'
  plugins:
    cloudwatch:
      namespace: 'heroku-metrics'
scenarios:
  - flow:
    - function: 'setupData'
    - post:
        url: '/users'
        json:
          user:
            email: '{{ email }}'
            password: '{{ password }}'
            username: '{{ username }}'
    - post:
        url: '/users/login'
        json:
          user:
            email: '{{ email }}'
            password: '{{ password }}'
            username: '{{ username }}'
        capture:
          json: '$.user.token'
          as: 'token'
    - get:
        url: '/user'
        headers:
          Authorization: 'Token {{ token }}'
    - put:
        url: '/user'
        ifTrue: updateUser
        headers:
          Authorization: 'Token {{ token }}'
    - post:
        url: '/articles'
        ifTrue: createArticle
        json:
          article:
            title: 'How to train your dragon'
            description: 'Ever wonder how?'
            body: 'Very carefully.'
            tagList:
              - 'dragons'
              - 'training'
        headers:
          Authorization: 'Token {{ token }}'
    - get:
        url: '/articles'
        headers:
          Authorization: 'Token {{ token }}'
    - get:
        url: '/articles?tag=dragons'
        headers:
          Authorization: 'Token {{ token }}'